#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```  ~ resource "keycloak_realm" "this" {
        id                                       = "public-cloud"
      + login_theme                              = "bcgov"
        # (42 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcregistry.keycloak_realm.this has changed
  ~ resource "keycloak_realm" "this" {
      ~ access_code_lifespan                     = "1m0s" -> "2m0s"
      ~ access_token_lifespan                    = "5m0s" -> "30m0s"
      ~ access_token_lifespan_for_implicit_flow  = "15m0s" -> "30m0s"
        id                                       = "bcregistry"
      ~ sso_session_idle_timeout                 = "30m0s" -> "8h0m0s"
      ~ sso_session_max_lifespan                 = "10h0m0s" -> "24h0m0s"
        # (39 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.foi-mod.keycloak_realm.this has changed
  ~ resource "keycloak_realm" "this" {
        id                                       = "foi-mod"
      + login_theme                              = "bcgov-idp-login"
        # (42 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.keycloak_realm.this has been deleted
  - resource "keycloak_realm" "this" {
      - access_code_lifespan                     = "1m0s" -> null
      - access_code_lifespan_login               = "30m0s" -> null
      - access_code_lifespan_user_action         = "5m0s" -> null
      - access_token_lifespan                    = "5m0s" -> null
      - access_token_lifespan_for_implicit_flow  = "15m0s" -> null
      - action_token_generated_by_admin_lifespan = "12h0m0s" -> null
      - action_token_generated_by_user_lifespan  = "5m0s" -> null
      - attributes                               = {} -> null
      - browser_flow                             = "browser" -> null
      - client_authentication_flow               = "clients" -> null
      - client_session_idle_timeout              = "0s" -> null
      - client_session_max_lifespan              = "0s" -> null
      - default_default_client_scopes            = [] -> null
      - default_optional_client_scopes           = [] -> null
      - direct_grant_flow                        = "direct grant" -> null
      - docker_authentication_flow               = "docker auth" -> null
      - duplicate_emails_allowed                 = false -> null
      - edit_username_allowed                    = false -> null
      - enabled                                  = true -> null
      - id                                       = "aestsims" -> null
      - internal_id                              = "aestsims" -> null
      - login_with_email_allowed                 = false -> null
      - oauth2_device_code_lifespan              = "10m0s" -> null
      - oauth2_device_polling_interval           = 5 -> null
      - offline_session_idle_timeout             = "720h0m0s" -> null
      - offline_session_max_lifespan             = "1440h0m0s" -> null
      - offline_session_max_lifespan_enabled     = false -> null
      - realm                                    = "aestsims" -> null
      - refresh_token_max_reuse                  = 0 -> null
      - registration_allowed                     = false -> null
      - registration_email_as_username           = false -> null
      - registration_flow                        = "registration" -> null
      - remember_me                              = false -> null
      - reset_credentials_flow                   = "reset credentials" -> null
      - reset_password_allowed                   = false -> null
      - revoke_refresh_token                     = false -> null
      - ssl_required                             = "external" -> null
      - sso_session_idle_timeout                 = "30m0s" -> null
      - sso_session_idle_timeout_remember_me     = "0s" -> null
      - sso_session_max_lifespan                 = "10h0m0s" -> null
      - sso_session_max_lifespan_remember_me     = "0s" -> null
      - user_managed_access                      = false -> null
      - verify_email                             = false -> null

      - otp_policy {
          - algorithm         = "HmacSHA1" -> null
          - digits            = 6 -> null
          - initial_counter   = 0 -> null
          - look_ahead_window = 1 -> null
          - period            = 30 -> null
          - type              = "totp" -> null
        }

      - web_authn_passwordless_policy {
          - acceptable_aaguids                = [] -> null
          - attestation_conveyance_preference = "not specified" -> null
          - authenticator_attachment          = "not specified" -> null
          - avoid_same_authenticator_register = false -> null
          - create_timeout                    = 0 -> null
          - relying_party_entity_name         = "keycloak" -> null
          - require_resident_key              = "not specified" -> null
          - signature_algorithms              = [
              - "ES256",
            ] -> null
          - user_verification_requirement     = "not specified" -> null
        }

      - web_authn_policy {
          - acceptable_aaguids                = [] -> null
          - attestation_conveyance_preference = "not specified" -> null
          - authenticator_attachment          = "not specified" -> null
          - avoid_same_authenticator_register = false -> null
          - create_timeout                    = 0 -> null
          - relying_party_entity_name         = "keycloak" -> null
          - require_resident_key              = "not specified" -> null
          - signature_algorithms              = [
              - "ES256",
            ] -> null
          - user_verification_requirement     = "not specified" -> null
        }
    }

  # module.keycloak_test.module.custom_realms.module.bcregistry.keycloak_realm.this has changed
  ~ resource "keycloak_realm" "this" {
      ~ access_token_lifespan                    = "5m0s" -> "30m0s"
      ~ client_session_idle_timeout              = "0s" -> "24h0m0s"
      ~ client_session_max_lifespan              = "0s" -> "24h0m0s"
        id                                       = "bcregistry"
      ~ offline_session_idle_timeout             = "720h0m0s" -> "24h0m0s"
      ~ sso_session_idle_timeout                 = "30m0s" -> "8h0m0s"
      ~ sso_session_max_lifespan                 = "10h0m0s" -> "24h0m0s"
        # (38 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.keycloak_test.module.custom_realms.module.foi-mod.keycloak_realm.this has changed
  ~ resource "keycloak_realm" "this" {
      ~ access_token_lifespan                    = "5m0s" -> "1h0m0s"
        id                                       = "foi-mod"
      ~ sso_session_idle_timeout                 = "30m0s" -> "12h0m0s"
      ~ sso_session_max_lifespan                 = "10h0m0s" -> "12h0m0s"
        # (40 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin.module.realm_admin.keycloak_group.group has been deleted
  - resource "keycloak_group" "group" {
      - attributes = {} -> null
      - id         = "23a0f5df-48cc-4bfb-ae78-e2668f217ac5" -> null
      - name       = "Realm Administrator" -> null
      - path       = "/Realm Administrator" -> null
      - realm_id   = "aestsims" -> null
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding has been deleted
  - resource "keycloak_group_roles" "role_group_binding" {
      - exhaustive = true -> null
      - group_id   = "23a0f5df-48cc-4bfb-ae78-e2668f217ac5" -> null
      - id         = "aestsims/23a0f5df-48cc-4bfb-ae78-e2668f217ac5" -> null
      - realm_id   = "aestsims" -> null
      - role_ids   = [
          - "ce4fb77f-4fd2-491a-8740-ac9b06a35d18",
        ] -> null
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account has been deleted
  - resource "keycloak_openid_client" "service_account" {
      - access_type                                = "CONFIDENTIAL" -> null
      - backchannel_logout_revoke_offline_sessions = false -> null
      - backchannel_logout_session_required        = true -> null
      - client_authenticator_type                  = "client-secret" -> null
      - client_id                                  = "realm-admin-cli" -> null
      - client_secret                              = (sensitive value)
      - consent_required                           = false -> null
      - direct_access_grants_enabled               = false -> null
      - display_on_consent_screen                  = false -> null
      - enabled                                    = true -> null
      - exclude_session_state_from_auth_response   = false -> null
      - extra_config                               = {} -> null
      - frontchannel_logout_enabled                = false -> null
      - full_scope_allowed                         = true -> null
      - id                                         = "cc7817c7-e6d1-4556-8db9-f5a7c69dd1e3" -> null
      - implicit_flow_enabled                      = false -> null
      - name                                       = "realm-admin-cli" -> null
      - oauth2_device_authorization_grant_enabled  = false -> null
      - realm_id                                   = "aestsims" -> null
      - service_account_user_id                    = "4809e1e3-b82e-4ae1-bb1f-9e57b07adcfa" -> null
      - service_accounts_enabled                   = true -> null
      - standard_flow_enabled                      = false -> null
      - use_refresh_tokens                         = true -> null
      - use_refresh_tokens_client_credentials      = false -> null
      - valid_redirect_uris                        = [] -> null
      - web_origins                                = [] -> null
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding has been deleted
  - resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      - id                      = "4809e1e3-b82e-4ae1-bb1f-9e57b07adcfa/ce4fb77f-4fd2-491a-8740-ac9b06a35d18" -> null
      - realm_id                = "aestsims" -> null
      - role                    = "realm-admin" -> null
      - service_account_user_id = "4809e1e3-b82e-4ae1-bb1f-9e57b07adcfa" -> null
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin.module.realm_admin.keycloak_role.role has been deleted
  - resource "keycloak_role" "role" {
      - attributes      = {} -> null
      - composite_roles = [
          - "1f28df22-24cf-4aa8-b088-e92fcc86531d",
        ] -> null
      - id              = "ce4fb77f-4fd2-491a-8740-ac9b06a35d18" -> null
      - name            = "realm-admin" -> null
      - realm_id        = "aestsims" -> null
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_viewer.module.realm_viewer.keycloak_group.group has been deleted
  - resource "keycloak_group" "group" {
      - attributes = {} -> null
      - id         = "69811bcd-f7aa-4a56-a3e6-368be1c3adcb" -> null
      - name       = "Realm Viewer" -> null
      - path       = "/Realm Viewer" -> null
      - realm_id   = "aestsims" -> null
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding has been deleted
  - resource "keycloak_group_roles" "role_group_binding" {
      - exhaustive = true -> null
      - group_id   = "69811bcd-f7aa-4a56-a3e6-368be1c3adcb" -> null
      - id         = "aestsims/69811bcd-f7aa-4a56-a3e6-368be1c3adcb" -> null
      - realm_id   = "aestsims" -> null
      - role_ids   = [
          - "c76bdd26-1598-4c3d-a245-c3823abfa025",
        ] -> null
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account has been deleted
  - resource "keycloak_openid_client" "service_account" {
      - access_type                                = "CONFIDENTIAL" -> null
      - backchannel_logout_revoke_offline_sessions = false -> null
      - backchannel_logout_session_required        = true -> null
      - client_authenticator_type                  = "client-secret" -> null
      - client_id                                  = "realm-viewer-cli" -> null
      - client_secret                              = (sensitive value)
      - consent_required                           = false -> null
      - direct_access_grants_enabled               = false -> null
      - display_on_consent_screen                  = false -> null
      - enabled                                    = true -> null
      - exclude_session_state_from_auth_response   = false -> null
      - extra_config                               = {} -> null
      - frontchannel_logout_enabled                = false -> null
      - full_scope_allowed                         = true -> null
      - id                                         = "ed8d6a5e-3f7e-497e-b002-b8219cefe763" -> null
      - implicit_flow_enabled                      = false -> null
      - name                                       = "realm-viewer-cli" -> null
      - oauth2_device_authorization_grant_enabled  = false -> null
      - realm_id                                   = "aestsims" -> null
      - service_account_user_id                    = "c528613f-ff75-40b8-8a42-d96d90098614" -> null
      - service_accounts_enabled                   = true -> null
      - standard_flow_enabled                      = false -> null
      - use_refresh_tokens                         = true -> null
      - use_refresh_tokens_client_credentials      = false -> null
      - valid_redirect_uris                        = [] -> null
      - web_origins                                = [] -> null
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding has been deleted
  - resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      - id                      = "c528613f-ff75-40b8-8a42-d96d90098614/c76bdd26-1598-4c3d-a245-c3823abfa025" -> null
      - realm_id                = "aestsims" -> null
      - role                    = "realm-viewer" -> null
      - service_account_user_id = "c528613f-ff75-40b8-8a42-d96d90098614" -> null
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_viewer.module.realm_viewer.keycloak_role.role has been deleted
  - resource "keycloak_role" "role" {
      - attributes      = {} -> null
      - composite_roles = [
          - "05b26815-a01a-45f8-9ea7-660389c4a6d2",
          - "0f9dee78-00d7-4445-8a10-e0eb6e89232d",
          - "40b9a7ef-3e65-487d-b9b9-2cab44bd318e",
          - "655584cd-5491-4019-9764-fd33dbd80ca4",
          - "7afef200-9cf6-4241-98ee-d48cf60b44c4",
          - "c26610cd-5a08-4da5-bf21-cd2d73c6c4fa",
        ] -> null
      - id              = "c76bdd26-1598-4c3d-a245-c3823abfa025" -> null
      - name            = "realm-viewer" -> null
      - realm_id        = "aestsims" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.keycloak_test.module.custom_realms.module.aestsims.keycloak_realm.this will be created
  + resource "keycloak_realm" "this" {
      + access_code_lifespan                     = (known after apply)
      + access_code_lifespan_login               = (known after apply)
      + access_code_lifespan_user_action         = (known after apply)
      + access_token_lifespan                    = (known after apply)
      + access_token_lifespan_for_implicit_flow  = (known after apply)
      + action_token_generated_by_admin_lifespan = (known after apply)
      + action_token_generated_by_user_lifespan  = (known after apply)
      + browser_flow                             = (known after apply)
      + client_authentication_flow               = (known after apply)
      + client_session_idle_timeout              = (known after apply)
      + client_session_max_lifespan              = (known after apply)
      + direct_grant_flow                        = (known after apply)
      + docker_authentication_flow               = (known after apply)
      + duplicate_emails_allowed                 = (known after apply)
      + edit_username_allowed                    = (known after apply)
      + enabled                                  = false
      + id                                       = (known after apply)
      + internal_id                              = (known after apply)
      + login_with_email_allowed                 = (known after apply)
      + oauth2_device_code_lifespan              = (known after apply)
      + oauth2_device_polling_interval           = (known after apply)
      + offline_session_idle_timeout             = (known after apply)
      + offline_session_max_lifespan             = (known after apply)
      + offline_session_max_lifespan_enabled     = false
      + realm                                    = "aestsims"
      + refresh_token_max_reuse                  = 0
      + registration_allowed                     = (known after apply)
      + registration_email_as_username           = (known after apply)
      + registration_flow                        = (known after apply)
      + remember_me                              = (known after apply)
      + reset_credentials_flow                   = (known after apply)
      + reset_password_allowed                   = (known after apply)
      + revoke_refresh_token                     = false
      + ssl_required                             = "external"
      + sso_session_idle_timeout                 = (known after apply)
      + sso_session_idle_timeout_remember_me     = (known after apply)
      + sso_session_max_lifespan                 = (known after apply)
      + sso_session_max_lifespan_remember_me     = (known after apply)
      + user_managed_access                      = false
      + verify_email                             = (known after apply)

      + otp_policy {
          + algorithm         = (known after apply)
          + digits            = (known after apply)
          + initial_counter   = (known after apply)
          + look_ahead_window = (known after apply)
          + period            = (known after apply)
          + type              = (known after apply)
        }

      + web_authn_passwordless_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }

      + web_authn_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin_master.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      ~ access_type                                = "BEARER-ONLY" -> (known after apply)
      + admin_url                                  = (known after apply)
      ~ authentication_flow_binding_overrides      = [] -> (known after apply)
      ~ authorization                              = [] -> (known after apply)
      ~ backchannel_logout_revoke_offline_sessions = false -> (known after apply)
      ~ backchannel_logout_session_required        = false -> (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      ~ client_authenticator_type                  = "client-secret" -> (known after apply)
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      ~ consent_required                           = false -> (known after apply)
      + description                                = (known after apply)
      ~ direct_access_grants_enabled               = false -> (known after apply)
      - display_on_consent_screen                  = false -> null
      ~ enabled                                    = true -> (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      ~ extra_config                               = {} -> (known after apply)
      ~ frontchannel_logout_enabled                = false -> (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      ~ full_scope_allowed                         = false -> (known after apply)
      ~ id                                         = "8edc2f5c-04ea-4109-9a4b-30fc131d565b" -> (known after apply)
      ~ implicit_flow_enabled                      = false -> (known after apply)
      + login_theme                                = (known after apply)
      ~ name                                       = "aestsims Realm" -> (known after apply)
      - oauth2_device_authorization_grant_enabled  = false -> null
      + pkce_code_challenge_method                 = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      ~ service_accounts_enabled                   = false -> (known after apply)
      ~ standard_flow_enabled                      = true -> (known after apply)
      ~ use_refresh_tokens                         = false -> (known after apply)
      ~ use_refresh_tokens_client_credentials      = false -> (known after apply)
      ~ valid_redirect_uris                        = [] -> (known after apply)
      ~ web_origins                                = [] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin_master.data.keycloak_role.target_roles["create-client"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "8edc2f5c-04ea-4109-9a4b-30fc131d565b" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_create-client}" -> (known after apply)
      ~ id              = "06ee3247-c7de-44f8-8d83-41167cf39d1a" -> (known after apply)
        name            = "create-client"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin_master.data.keycloak_role.target_roles["impersonation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "8edc2f5c-04ea-4109-9a4b-30fc131d565b" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_impersonation}" -> (known after apply)
      ~ id              = "36318f2f-4f87-471d-8edc-252f8669c26d" -> (known after apply)
        name            = "impersonation"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin_master.data.keycloak_role.target_roles["manage-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "8edc2f5c-04ea-4109-9a4b-30fc131d565b" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-authorization}" -> (known after apply)
      ~ id              = "54d6f974-5de7-497a-b07e-24f54ca3b9bb" -> (known after apply)
        name            = "manage-authorization"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin_master.data.keycloak_role.target_roles["manage-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "8edc2f5c-04ea-4109-9a4b-30fc131d565b" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-clients}" -> (known after apply)
      ~ id              = "38de15bd-367d-4973-9dbe-bf2f1425a2d3" -> (known after apply)
        name            = "manage-clients"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin_master.data.keycloak_role.target_roles["manage-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "8edc2f5c-04ea-4109-9a4b-30fc131d565b" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-events}" -> (known after apply)
      ~ id              = "4b72b0aa-9076-4560-8ad3-b45e49841be1" -> (known after apply)
        name            = "manage-events"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin_master.data.keycloak_role.target_roles["manage-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "8edc2f5c-04ea-4109-9a4b-30fc131d565b" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-identity-providers}" -> (known after apply)
      ~ id              = "003c709a-de83-40af-b612-8039ac477e39" -> (known after apply)
        name            = "manage-identity-providers"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin_master.data.keycloak_role.target_roles["manage-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "8edc2f5c-04ea-4109-9a4b-30fc131d565b" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-realm}" -> (known after apply)
      ~ id              = "f10bd302-e296-490d-b10c-4d732e550186" -> (known after apply)
        name            = "manage-realm"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin_master.data.keycloak_role.target_roles["manage-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "8edc2f5c-04ea-4109-9a4b-30fc131d565b" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-users}" -> (known after apply)
      ~ id              = "b197c0ba-662a-41ce-a6d9-cbf16f166788" -> (known after apply)
        name            = "manage-users"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin_master.data.keycloak_role.target_roles["query-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "8edc2f5c-04ea-4109-9a4b-30fc131d565b" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_query-clients}" -> (known after apply)
      ~ id              = "d1a18106-14fc-47f1-9fe1-e9bb2217756f" -> (known after apply)
        name            = "query-clients"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin_master.data.keycloak_role.target_roles["query-groups"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "8edc2f5c-04ea-4109-9a4b-30fc131d565b" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_query-groups}" -> (known after apply)
      ~ id              = "6fcb55c4-83be-4330-888d-3eec30c64db3" -> (known after apply)
        name            = "query-groups"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin_master.data.keycloak_role.target_roles["query-realms"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "8edc2f5c-04ea-4109-9a4b-30fc131d565b" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_query-realms}" -> (known after apply)
      ~ id              = "a8c531da-4abf-4c5f-9788-e07444e66b5b" -> (known after apply)
        name            = "query-realms"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin_master.data.keycloak_role.target_roles["query-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "8edc2f5c-04ea-4109-9a4b-30fc131d565b" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_query-users}" -> (known after apply)
      ~ id              = "4f3be20c-09d2-4f60-913b-b42f34deee27" -> (known after apply)
        name            = "query-users"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin_master.data.keycloak_role.target_roles["view-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "8edc2f5c-04ea-4109-9a4b-30fc131d565b" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-authorization}" -> (known after apply)
      ~ id              = "1d0baf52-c953-46bc-9984-dc16ce2aa2d6" -> (known after apply)
        name            = "view-authorization"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin_master.data.keycloak_role.target_roles["view-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "8edc2f5c-04ea-4109-9a4b-30fc131d565b" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-clients}" -> (known after apply)
      ~ id              = "3278d8a6-d699-4272-80ba-6867cd8c41df" -> (known after apply)
        name            = "view-clients"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin_master.data.keycloak_role.target_roles["view-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "8edc2f5c-04ea-4109-9a4b-30fc131d565b" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-events}" -> (known after apply)
      ~ id              = "f023577e-e107-4a0b-9af4-0cfe9c0e896a" -> (known after apply)
        name            = "view-events"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin_master.data.keycloak_role.target_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "8edc2f5c-04ea-4109-9a4b-30fc131d565b" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-identity-providers}" -> (known after apply)
      ~ id              = "834f519f-68b7-4bc5-875e-6e5e85cee183" -> (known after apply)
        name            = "view-identity-providers"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin_master.data.keycloak_role.target_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "8edc2f5c-04ea-4109-9a4b-30fc131d565b" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-realm}" -> (known after apply)
      ~ id              = "021f39c7-ebe3-4590-a1a9-fbfee4ca8759" -> (known after apply)
        name            = "view-realm"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin_master.data.keycloak_role.target_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "8edc2f5c-04ea-4109-9a4b-30fc131d565b" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-users}" -> (known after apply)
      ~ id              = "dab4af30-cde8-4f73-a8f1-8ebd53190a3e" -> (known after apply)
        name            = "view-users"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin_master.keycloak_role.role will be updated in-place
  ~ resource "keycloak_role" "role" {
      ~ composite_roles = [
          - "003c709a-de83-40af-b612-8039ac477e39",
          - "021f39c7-ebe3-4590-a1a9-fbfee4ca8759",
          - "06ee3247-c7de-44f8-8d83-41167cf39d1a",
          - "1d0baf52-c953-46bc-9984-dc16ce2aa2d6",
          - "3278d8a6-d699-4272-80ba-6867cd8c41df",
          - "36318f2f-4f87-471d-8edc-252f8669c26d",
          - "38de15bd-367d-4973-9dbe-bf2f1425a2d3",
          - "4b72b0aa-9076-4560-8ad3-b45e49841be1",
          - "4f3be20c-09d2-4f60-913b-b42f34deee27",
          - "54d6f974-5de7-497a-b07e-24f54ca3b9bb",
          - "6fcb55c4-83be-4330-888d-3eec30c64db3",
          - "834f519f-68b7-4bc5-875e-6e5e85cee183",
          - "a8c531da-4abf-4c5f-9788-e07444e66b5b",
          - "b197c0ba-662a-41ce-a6d9-cbf16f166788",
          - "d1a18106-14fc-47f1-9fe1-e9bb2217756f",
          - "dab4af30-cde8-4f73-a8f1-8ebd53190a3e",
          - "f023577e-e107-4a0b-9af4-0cfe9c0e896a",
          - "f10bd302-e296-490d-b10c-4d732e550186",
        ] -> (known after apply)
        id              = "d5584272-4381-41e2-8e8d-2083a9009bc6"
        name            = "aestsims-realm-admin"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.moti-custom.module.realm_admin.module.realm_admin.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Administrator"
      + path     = (known after apply)
      + realm_id = "moti-custom"
    }

  # module.keycloak_dev.module.custom_realms.module.moti-custom.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "moti-custom"
      + role_ids   = [
          + "830c068f-29c3-447e-afdb-98675ffb4492",
        ]
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin.module.realm_admin.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      ~ access_type                                = "BEARER-ONLY" -> (known after apply)
      + admin_url                                  = (known after apply)
      ~ authentication_flow_binding_overrides      = [] -> (known after apply)
      ~ authorization                              = [] -> (known after apply)
      ~ backchannel_logout_revoke_offline_sessions = false -> (known after apply)
      ~ backchannel_logout_session_required        = false -> (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      ~ client_authenticator_type                  = "client-secret" -> (known after apply)
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      ~ consent_required                           = false -> (known after apply)
      + description                                = (known after apply)
      ~ direct_access_grants_enabled               = false -> (known after apply)
      - display_on_consent_screen                  = false -> null
      ~ enabled                                    = true -> (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      ~ extra_config                               = {} -> (known after apply)
      ~ frontchannel_logout_enabled                = false -> (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      ~ full_scope_allowed                         = false -> (known after apply)
      ~ id                                         = "233abd71-385f-474a-bed0-039a6d2b39c8" -> (known after apply)
      ~ implicit_flow_enabled                      = false -> (known after apply)
      + login_theme                                = (known after apply)
      ~ name                                       = "${client_realm-management}" -> (known after apply)
      - oauth2_device_authorization_grant_enabled  = false -> null
      + pkce_code_challenge_method                 = (known after apply)
      ~ realm_id                                   = "aestsims" -> (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      ~ service_accounts_enabled                   = false -> (known after apply)
      ~ standard_flow_enabled                      = true -> (known after apply)
      ~ use_refresh_tokens                         = false -> (known after apply)
      ~ use_refresh_tokens_client_credentials      = false -> (known after apply)
      ~ valid_redirect_uris                        = [] -> (known after apply)
      ~ web_origins                                = [] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin.module.realm_admin.data.keycloak_role.target_roles["realm-admin"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "233abd71-385f-474a-bed0-039a6d2b39c8" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_realm-admin}" -> (known after apply)
      ~ id              = "1f28df22-24cf-4aa8-b088-e92fcc86531d" -> (known after apply)
        name            = "realm-admin"
      ~ realm_id        = "aestsims" -> (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin.module.realm_admin.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Administrator"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-admin-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-admin-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = (known after apply)
      + role                    = "realm-admin"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin.module.realm_admin.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_viewer.module.realm_viewer.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      ~ access_type                                = "BEARER-ONLY" -> (known after apply)
      + admin_url                                  = (known after apply)
      ~ authentication_flow_binding_overrides      = [] -> (known after apply)
      ~ authorization                              = [] -> (known after apply)
      ~ backchannel_logout_revoke_offline_sessions = false -> (known after apply)
      ~ backchannel_logout_session_required        = false -> (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      ~ client_authenticator_type                  = "client-secret" -> (known after apply)
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      ~ consent_required                           = false -> (known after apply)
      + description                                = (known after apply)
      ~ direct_access_grants_enabled               = false -> (known after apply)
      - display_on_consent_screen                  = false -> null
      ~ enabled                                    = true -> (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      ~ extra_config                               = {} -> (known after apply)
      ~ frontchannel_logout_enabled                = false -> (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      ~ full_scope_allowed                         = false -> (known after apply)
      ~ id                                         = "233abd71-385f-474a-bed0-039a6d2b39c8" -> (known after apply)
      ~ implicit_flow_enabled                      = false -> (known after apply)
      + login_theme                                = (known after apply)
      ~ name                                       = "${client_realm-management}" -> (known after apply)
      - oauth2_device_authorization_grant_enabled  = false -> null
      + pkce_code_challenge_method                 = (known after apply)
      ~ realm_id                                   = "aestsims" -> (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      ~ service_accounts_enabled                   = false -> (known after apply)
      ~ standard_flow_enabled                      = true -> (known after apply)
      ~ use_refresh_tokens                         = false -> (known after apply)
      ~ use_refresh_tokens_client_credentials      = false -> (known after apply)
      ~ valid_redirect_uris                        = [] -> (known after apply)
      ~ web_origins                                = [] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "233abd71-385f-474a-bed0-039a6d2b39c8" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-authorization}" -> (known after apply)
      ~ id              = "40b9a7ef-3e65-487d-b9b9-2cab44bd318e" -> (known after apply)
        name            = "view-authorization"
      ~ realm_id        = "aestsims" -> (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "233abd71-385f-474a-bed0-039a6d2b39c8" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-clients}" -> (known after apply)
      ~ id              = "7afef200-9cf6-4241-98ee-d48cf60b44c4" -> (known after apply)
        name            = "view-clients"
      ~ realm_id        = "aestsims" -> (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "233abd71-385f-474a-bed0-039a6d2b39c8" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-events}" -> (known after apply)
      ~ id              = "05b26815-a01a-45f8-9ea7-660389c4a6d2" -> (known after apply)
        name            = "view-events"
      ~ realm_id        = "aestsims" -> (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "233abd71-385f-474a-bed0-039a6d2b39c8" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-identity-providers}" -> (known after apply)
      ~ id              = "655584cd-5491-4019-9764-fd33dbd80ca4" -> (known after apply)
        name            = "view-identity-providers"
      ~ realm_id        = "aestsims" -> (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "233abd71-385f-474a-bed0-039a6d2b39c8" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-realm}" -> (known after apply)
      ~ id              = "c26610cd-5a08-4da5-bf21-cd2d73c6c4fa" -> (known after apply)
        name            = "view-realm"
      ~ realm_id        = "aestsims" -> (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "233abd71-385f-474a-bed0-039a6d2b39c8" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-users}" -> (known after apply)
      ~ id              = "0f9dee78-00d7-4445-8a10-e0eb6e89232d" -> (known after apply)
        name            = "view-users"
      ~ realm_id        = "aestsims" -> (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_viewer.module.realm_viewer.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Viewer"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-viewer-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-viewer-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = (known after apply)
      + role                    = "realm-viewer"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.aestsims.module.realm_viewer.module.realm_viewer.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "realm-viewer"
      + realm_id        = (known after apply)
    }

Plan: 13 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...```

</details>

*Pusher: @NithinKuruba, Action: `pull_request`*